case_up_half_cube_02/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 286.15;

boundaryField
{
    left
    {
        type            symmetryPlane;
    }

    // inletOutlet: zeroGradient on outflow, fixed ambient T on backflow.
    right
    {
        type            inletOutlet;
        inletValue      uniform 286.15;
        value           uniform 286.15;
    }

    top
    {
        type            inletOutlet;
        inletValue      uniform 286.15;
        value           uniform 286.15;
    }

    bottom
    {
        type            inletOutlet;
        inletValue      uniform 286.15;
        value           uniform 286.15;
    }

    front
    {
        type            inletOutlet;
        inletValue      uniform 286.15;
        value           uniform 286.15;
    }

    back
    {
        type            inletOutlet;
        inletValue      uniform 286.15;
        value           uniform 286.15;
    }

    walls
    {
        type            zeroGradient;
    }

    source
    {
        type            fixedValue;
        value           uniform 286.15;
    }

    nozzle_wall_rest
    {
        type            zeroGradient;
    }
}
