case_up_half_cube_02/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 2.76e-6;

boundaryField
{
    left
    {
        type            symmetryPlane;
    }

    right
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    bottom
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    front
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    back
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    walls
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    // mixingLength = 0.07 * D_nozzle = 0.07 * 0.01 m = 7e-4 m
    source
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    7e-4;
        phi             phi;
        k               k;
        value           uniform 1;
    }

    nozzle_wall_rest
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}
