case_up_half_cube_02/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    {
        name    source;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            patch "nozzle_wall";
        }
    }

    {
        name    source;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
        {
            // Source is at the bottom of the nozzle channel at z~1.0 m.
            // z-range widened to ±10 mm (> cell size ~3.9 mm at level 8) for robustness.
            // x/y cover the 1 cm nozzle opening plus one-cell margin.
            box (-0.005 -0.01 0.99) (0.015 0.01 1.01);
        }
    }

    {
        name    source;
        type    faceSet;
        action  subset;
        source  normalToFace;
        sourceInfo
        {
            normal (0 0 -1);
            cos    0.95;
        }
    }

    {
        name    nozzle_wall_rest;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            patch "nozzle_wall";
        }
    }

    {
        name    nozzle_wall_rest;
        type    faceSet;
        action  subtract;
        source  faceToFace;
        set     source;
    }
);
